Repository: LucasPerrault/CC.Master
Catalog: back/Billing/Billing.Contracts/Billing.Contracts.Domain/Resources/Translations/ContractsTranslations.*.resx
Languages: fr

# create_offer_exception_message
source: Cannot create offer: {0}
fr: Impossible de créer une offre : {0}

# create_price_list_exception_message
source: Cannot create price list for offer {0}: {1}
fr: Impossible de créer la grille pour l'offre {0} : {1}

# delete_offer_exception_message
source: Cannot archive offer {0}: {1}
fr: Impossible d'archiver l'offre {0} : {1}

# delete_price_list_exception_message
source: Cannot delete price list {0} for offer {1}: {2}
fr: Impossible de supprimer la grille {0} pour l'offre {1} : {2}

# import_offer_missing_header
source: The following headers are missing :
fr: Les en-têtes suivantes sont manquantes :

# modify_offer_exception_message
source: Cannot modify offer {0}: {1}
fr: Impossible de modifier l'offre {0} : {1}

# modify_price_list_exception_message
source: Cannot modify price list {0} for offer {1}: {2}
fr: Impossible de modifier la grille {0} pour l'offre {1} : {2}

# offer_changed_despite_count
source: The properties of an offer cannot be modified if a related contract has a count
fr: Les propriétés d’une offre ne peuvent être modifiées si un contrat rattaché possède un décompte

# oldest_price_list_start_date_changed
source: The start date of the oldest price list can never be changed
fr: La date de démarrage de la grille la plus vieille n’est jamais modifiable

# price_list_changed
source: The properties of a price list or its rows cannot be modified via this query
fr: Les propriétés d’une grille ou de ses lignes ne peuvent être modifiées via cette requête

# price_list_changed_despite_count
source: The properties of a price list or its rows cannot be modified if a related contract has a count (except for the addition on top of the highest bracket)
fr: Les propriétés d’une grille ou de ses lignes ne peuvent être modifiées si un contrat rattaché possède un décompte (sauf ajout sur tranche supérieure)

# price_list_detached
source: A price list attached to an offer cannot be detached from this offer
fr: Une grille rattachée à une offre ne peut pas être détachée de cette offre

# price_list_has_negative_amounts
source: The list has at least one negative amount.
fr: La liste a au moins un montant négatif.

# price_list_should_have_rows
source: A price list must have rows
fr: Une grille doit comporter des lignes

# price_list_start_defined_before_this_month
source: The start date of a price list cannot be created or updated before the current month
fr: La date de démarrage d’une grille ne peut être créée ou mise à jour avant le mois courant

# price_list_starts_on_first_of_month
source: The start date of a price list must be the first of the month
fr: La date de démarrage d'une grille doit être le premier du mois

# price_lists_starts_on_same_day
source: An offer cannot have two price lists on the same start date
fr: Une offre ne peut pas avoir deux grilles à la même date de démarrage

# price_row_detached
source: A price row attached to a price list cannot change price list
fr: Une ligne rattachée à une grille ne peut pas changer de grille

# price_rows_not_ordered
source: The lines of the price list are not correctly ordered.
fr: Les lignes de la grille tarifaire ne sont pas correctement ordonnées.

# started_price_list_deleted
source: A price list can no longer be deleted if its start date has passed
fr: On ne peut plus supprimer une grille si sa date de démarrage est passée
